In [3]:
import numpy as np

In [4]:
import pandas as pd

In [6]:
d={"usn":[100,101,102],
   "name":["jerry","tom","ramesh"],
    "mobile":[99,98,77],
    "marks":[30,35,None]
    }

In [7]:
d

{'usn': [100, 101, 102],
 'name': ['jerry', 'tom', 'ramesh'],
 'mobile': [99, 98, 77],
 'marks': [30, 35, None]}

In [8]:
std=pd.DataFrame(d)

In [9]:
std

   usn    name  mobile  marks
0  100   jerry      99   30.0
1  101     tom      98   35.0
2  102  ramesh      77    NaN

In [10]:
std.head()

   usn    name  mobile  marks
0  100   jerry      99   30.0
1  101     tom      98   35.0
2  102  ramesh      77    NaN

In [11]:
std.head(1)

   usn   name  mobile  marks
0  100  jerry      99   30.0

In [12]:
std.head(2)

   usn   name  mobile  marks
0  100  jerry      99   30.0
1  101    tom      98   35.0

In [13]:
std.tail()

   usn    name  mobile  marks
0  100   jerry      99   30.0
1  101     tom      98   35.0
2  102  ramesh      77    NaN

In [14]:
std.tail(1)

   usn    name  mobile  marks
2  102  ramesh      77    NaN

In [15]:
std.tail(2)

   usn    name  mobile  marks
1  101     tom      98   35.0
2  102  ramesh      77    NaN

In [16]:
std.columns

Index(['usn', 'name', 'mobile', 'marks'], dtype='object')

In [17]:
std["usn"]

0    100
1    101
2    102
Name: usn, dtype: int64

In [18]:
std.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   usn     3 non-null      int64
 1   name    3 non-null      object
 2   mobile  3 non-null      int64
 3   marks   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 224.0+ bytes

In [19]:
std.isnull()

     usn   name  mobile  marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False   True

In [22]:
std[["usn","name"]]

   usn    name
0  100   jerry
1  101     tom
2  102  ramesh

In [24]:
std.loc[1]

usn        101
name       tom
mobile      98
marks     35.0
Name: 1, dtype: object

In [25]:
std.iloc[1]

usn        101
name       tom
mobile      98
marks     35.0
Name: 1, dtype: object

In [29]:
std.set_index("usn")

       name  mobile  marks
usn
100   jerry      99   30.0
101     tom      98   35.0
102  ramesh      77    NaN

In [30]:
newdf=std["marks"]>=30

In [31]:
std[newdf]["name"]

0    jerry
1      tom
Name: name, dtype: object

In [33]:
std[["name","marks"]]

     name  marks
0   jerry   30.0
1     tom   35.0
2  ramesh    NaN

In [34]:
std[(std["name"]=="jerry")&(std["marks"]>20)]

   usn   name  mobile  marks
0  100  jerry      99   30.0

In [36]:
std[(std["name"]=="tom")&(std["marks"]>30)]

   usn name  mobile  marks
1  101  tom      98   35.0

In [40]:
std[(std["usn"]>100)&(std["marks"]<45)]

   usn name  mobile  marks
1  101  tom      98   35.0

In [43]:
s="benglore,delhi,kashmir".split(",")

In [44]:
print(s,type(s))

['benglore', 'delhi', 'kashmir'] <class 'list'>

In [45]:
std["address"]=s

In [47]:
std

   usn    name  mobile  marks   address
0  100   jerry      99   30.0  benglore
1  101     tom      98   35.0     delhi
2  102  ramesh      77    NaN   kashmir

In [48]:
std.drop("address",axis=1,inplace=True)

In [49]:
std

   usn    name  mobile  marks
0  100   jerry      99   30.0
1  101     tom      98   35.0
2  102  ramesh      77    NaN

In [51]:
std.drop(1)

   usn    name  mobile  marks
0  100   jerry      99   30.0
2  102  ramesh      77    NaN

In [54]:
d2={'USN':[100,101,102],
   'Name':['jerry','nan','ramesh'],
   'Mobile':[99,88,77],
   'marks':[30,35,None,]
}

In [55]:
df=pd.DataFrame(d2)

In [56]:
df

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     nan      88   35.0
2  102  ramesh      77    NaN

In [58]:
df.dropna()

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    nan      88   35.0

In [59]:
df.dropna(thresh=1)

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     nan      88   35.0
2  102  ramesh      77    NaN

In [60]:
df.dropna(thresh=4)

   USN   Name  Mobile  marks
0  100  jerry      99   30.0
1  101    nan      88   35.0

In [61]:
df.fillna(100)

   USN    Name  Mobile  marks
0  100   jerry      99   30.0
1  101     nan      88   35.0
2  102  ramesh      77  100.0

In [62]:
import pandas as pd

In [63]:
s=pd.Series(["a","b","c"])

In [64]:
s

0    a
1    b
2    c
dtype: object

In [65]:
print(type(s))

<class 'pandas.core.series.Series'>

In [66]:
df=pd.DataFrame(["x","y","z"],columns=["name"],index=[100,200,300])

In [67]:
df

    name
100    x
200    y
300    z

In [68]:
import numpy as np

In [69]:
from numpy import random

In [70]:
d=pd.DataFrame(np.random.rand(3,4))

In [71]:
d

          0         1         2         3
0  0.126887  0.062374  0.044890  0.403702
1  0.663237  0.533055  0.529412  0.433683
2  0.807604  0.179764  0.123584  0.333634

In [74]:
d=pd.DataFrame(np.random.rand(3,4),columns=['col1','col2','col3','col4'])

In [75]:
d

       col1      col2      col3      col4
0  0.099944  0.506841  0.674011  0.063381
1  0.908834  0.387926  0.188895  0.086755
2  0.350320  0.527832  0.822162  0.245971

In [76]:
d['col5']=d['col1']+d['col2']

In [77]:
d

       col1      col2      col3      col4      col5
0  0.099944  0.506841  0.674011  0.063381  0.606785
1  0.908834  0.387926  0.188895  0.086755  1.296760
2  0.350320  0.527832  0.822162  0.245971  0.878151

In [78]:
d.shape

(3, 5)

In [79]:
d.size

15

In [80]:
type(d)

pandas.core.frame.DataFrame

In [81]:
type(d["col1"])

pandas.core.series.Series